УТ_для_edt/src/Catalogs/CRM_ПравилаОбработкиОбращений/CRM_ПравилаОбработкиОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ПравилаОбработкиОбращений</name>
  <attributes>
    <name>ОбращенияКлиентаОтветственному</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбращенияПКОтветственному</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресацияОбращения</name>
    <type>
      <types>EnumRef.CRM_ВариантыАдресацииОбращения</types>
    </type>
  </attributes>
  <attributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбработки</name>
    <type>
      <types>EnumRef.CRM_ВариантыОбработкиОбращения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>CatalogRef.CRM_ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <type>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтклоненияОбращений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОчередьОтветственных</name>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/CRM_СостоянияЛидов/CRM_СостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СостоянияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.CRM_СостоянияЛидов</types>
    </type>
  </resources>
  <resources>
    <name>СконвертированВОбъект</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанСКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКанала</name>
    <type>
      <types>EnumRef.CRM_ВидыКаналовПоступленияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтклоненияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбработку</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтказаПоИнтересам</types>
    </type>
  </attributes>
  <dimensions>
    <name>Лид</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>CatalogRef.CRM_Диалоги</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_ВариантыОбработкиОбращения/CRM_ВариантыОбработкиОбращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВариантыОбработкиОбращения</name>
  <enumValues>
    <name>НеОбрабатывать</name>
  </enumValues>
  <enumValues>
    <name>СоздатьИнтерес</name>
  </enumValues>
  <enumValues>
    <name>ОтклонитьОбращение</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ВидыУсловийОбработкиОбращений/CRM_ВидыУсловийОбработкиОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыУсловийОбработкиОбращений</name>
  <enumValues>
    <name>СписокСлов</name>
  </enumValues>
  <enumValues>
    <name>МеткаПомощника</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ВариантыАдресацииОбращения/CRM_ВариантыАдресацииОбращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВариантыАдресацииОбращения</name>
  <enumValues>
    <name>НаПользователяВОчереди</name>
  </enumValues>
  <enumValues>
    <name>НаРольИсполнителя</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ВидыПапокЭлектроннойПочты/CRM_ВидыПапокЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыПапокЭлектроннойПочты</name>
  <enumValues>
    <name>Входящие</name>
  </enumValues>
  <enumValues>
    <name>Исходящие</name>
  </enumValues>
  <enumValues>
    <name>Отправленные</name>
  </enumValues>
  <enumValues>
    <name>Черновики</name>
  </enumValues>
  <enumValues>
    <name>Удаленные</name>
  </enumValues>
  <enumValues>
    <name>Обработанные</name>
  </enumValues>
  <enumValues>
    <name>НежелательнаяПочта</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_ТипыОбращений/CRM_ТипыОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ТипыОбращений</name>
  <predefined>
    <items>
      <name>Интерес</name>
      <description>Интерес</description>
    </items>
    <items>
      <name>Обращение</name>
      <description>Обращение</description>
    </items>
  </predefined>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_СостоянияЛидов/CRM_СостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <predefined>
    <items>
      <name>Новый</name>
      <description>Новое</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонено</description>
    </items>
    <items>
      <name>Повторный</name>
      <description>Повторное</description>
    </items>
    <items>
      <name>ПовторныйОбработанный</name>
      <description>Повторное (обработанное)</description>
    </items>
    <items>
      <name>Сконвертирован</name>
      <description>Сконвертировано</description>
    </items>
  </predefined>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_СостоянияИнтересов/CRM_СостоянияИнтересов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияИнтересов</name>
  <comment>Сценарии продаж</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <comment>Состояние завершения интереса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УказаниеОжидаемойВыручки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСостояния</name>
    <type>
      <types>EnumRef.CRM_ВидыСостоянияИнтереса</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОбязательноеЗаполнениеКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеПланированиеАктивности</name>
    <type>
      <types>EnumRef.CRM_ПланируемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтерактивноеПланированиеАктивностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьЗапланированныеАктивности</name>
    <type>
      <types>EnumRef.CRM_ЗавершаемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборЗавершаемыхАктивностей</name>
    <type>
      <types>EnumRef.CRM_ОтборыЗавершаемыхАктивностей</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьДостигнутыйРезультат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВероятностьВПредставлениеСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗадачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПоддержка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияСостояния</name>
    <type>
      <types>EnumRef.CRM_КатегорииСостоянийПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРолевуюАдресацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокНаЭтапе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартОписаниеЭтапа</name>
    <comment>//++ #1656 смарт: Фролов 27.02.2023 //Создание механизма отображения необходимых действий менеджером, на каждом этапе обработки Интереса.</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаКвалификацию</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаВыставлениеКП</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаСогласованиеКП</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаВыставлениеСчета</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаОплату</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыОбращений</name>
    <attributes>
      <name>ТипОбращения</name>
      <type>
        <types>CatalogRef.CRM_ТипыОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_ПравилаОбработкиОбращений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПрименитьПравило(Обращение) Экспорт
	
	Правило = ПравилоДляОбращения(Обращение);
	Если НЕ ЗначениеЗаполнено(Правило) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОтветственного(Обращение, Правило);
	
	Если ЗначениеЗаполнено(Правило.ВариантОбработки) 
		И Правило.ВариантОбработки <> Перечисления.CRM_ВариантыОбработкиОбращения.НеОбрабатывать Тогда
		
		Обращение.ДополнительныеСвойства.Вставить("ПравилоОбработкиОбращения", Правило);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПравилоДляОбращения(Обращение) Экспорт
	
	ИсточникОбращения = Неопределено;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Обращение, "УчетнаяЗапись") Тогда
		ИсточникОбращения = Обращение.УчетнаяЗапись;
	ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументОбъект.CRM_Заявка") Тогда
		ИсточникОбращения = Обращение.ИсточникПолучения;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ИсточникОбращения) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИсточникОбращения, "CRM_ОбрабатыватьОбращения") 
		И ИсточникОбращения.CRM_ОбрабатыватьОбращения Тогда
		
		ВключенаПоддержка = ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПоддержку");
		
		ПолучатьаМеткуКлассификации = Ложь;
		Если ВключенаПоддержка И CRM_МоделиМашинногоОбучения.КлассификацияОбращенийИспользуется() Тогда
			Для Каждого СтрокаПравил Из ИсточникОбращения.CRM_ПравилаОбработки Цикл
				Если СтрокаПравил.УсловиеОбработки.ВидУсловия = Перечисления.CRM_ВидыУсловийОбработкиОбращений.МеткаПомощника Тогда
					ПолучатьаМеткуКлассификации = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ПолучатьаМеткуКлассификации Тогда
			МеткаКлассификации = CRM_МоделиМашинногоОбучения.МеткаКлассификацииОбращения(Обращение.Текст);
			Если ЗначениеЗаполнено(МеткаКлассификации) Тогда
				Обращение.ДополнительныеСвойства.Вставить("МеткаКлассификации", МеткаКлассификации);
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого СтрокаПравил из ИсточникОбращения.CRM_ПравилаОбработки Цикл
			Если Справочники.CRM_УсловияОбработкиОбращений.УсловиеВыполнено(СтрокаПравил.УсловиеОбработки, Обращение) Тогда
				Если Не ВключенаПоддержка И СтрокаПравил.ПравилоОбработки.ВариантОбработки = Перечисления.CRM_ВариантыОбработкиОбращения.СоздатьИнтерес
					И Не СтрокаПравил.ПравилоОбработки.ТипОбращения = Справочники.CRM_ТипыОбращений.Интерес Тогда
					Продолжить;
				Иначе
					Возврат СтрокаПравил.ПравилоОбработки;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаполнитьОтветственного(Обращение, Правило)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Обращение, "Контакт") Тогда
		Контакт = Обращение.Контакт;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Обращение, "ОтправительКонтакт") Тогда
		Контакт = Обращение.ОтправительКонтакт;
	Иначе
		Контакт = Неопределено;
	КонецЕсли;
	
	Ответственный = Неопределено;
	РольОтветственного = Неопределено;
	
	ТипКонтакта = ТипЗнч(Контакт);
	Если ЗначениеЗаполнено(Контакт) Тогда
		Если ТипКонтакта = Тип("СправочникСсылка.Партнеры") Тогда
			Если Правило.ОбращенияКлиентаОтветственному Тогда
				Ответственный = Контакт.ОсновнойМенеджер;
			КонецЕсли;
		ИначеЕсли ТипКонтакта = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			Если Правило.ОбращенияКлиентаОтветственному Тогда
				Ответственный = Контакт.Владелец.ОсновнойМенеджер;
			КонецЕсли;
		ИначеЕсли ТипКонтакта = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
			Если Правило.ОбращенияПКОтветственному Тогда
				Ответственный = Контакт.ОсновнойМенеджер;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Если Правило.АдресацияОбращения = Перечисления.CRM_ВариантыАдресацииОбращения.НаРольИсполнителя Тогда
			РольОтветственного = Правило.РольИсполнителя;
		ИначеЕсли Правило.АдресацияОбращения = Перечисления.CRM_ВариантыАдресацииОбращения.НаПользователяВОчереди Тогда
			Ответственный = РегистрыСведений.CRM_ОчередьИсполнителей.СледующийИсполнитель(Правило); 
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ответственный) Тогда
		Обращение.Ответственный = Ответственный;
	ИначеЕсли ЗначениеЗаполнено(РольОтветственного) Тогда
		Обращение.CRM_РольОтветственного = РольОтветственного;
	КонецЕсли;
	
КонецПроцедуры

// Обрабатывает обращение.
// Параметры:
//  Обращение - Объект
//  Результат - Выходной параметр
//
Процедура ОбработатьОбращение(Обращение, Результат = Неопределено) Экспорт
	
	Если Обращение.ДополнительныеСвойства.Свойство("ПравилоОбработкиОбращения") Тогда
		Правило = Обращение.ДополнительныеСвойства.ПравилоОбработкиОбращения;
		СостояниеЛида = РегистрыСведений.CRM_СостоянияЛидов.ПолучитьТекущееСостояниеЛида(Обращение.Ссылка);
		Если ТипЗнч(СостояниеЛида) = Тип("Структура") Тогда
			Если СостояниеЛида.Состояние = Справочники.CRM_СостоянияЛидов.Новый Тогда
				Если Правило.ВариантОбработки = Перечисления.CRM_ВариантыОбработкиОбращения.СоздатьИнтерес Тогда
					СоздатьИнтерес(Обращение, Правило);
				ИначеЕсли Правило.ВариантОбработки = Перечисления.CRM_ВариантыОбработкиОбращения.ОтклонитьОбращение Тогда
					ОтклонитьОбращение(Обращение, Правило);
				КонецЕсли;
				
				Если ТипЗнч(Обращение.Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
					
					// Перенос в обработанные осуществляется, если учетная запись конкретного письма разрешает данное действие:
					Если Обращение.УчетнаяЗапись.CRM_ПереноситьВОбработанные Тогда						
						Папка = CRM_УправлениеЭлектроннойПочтой.ПолучитьПапкуЭлектронногоПисьма(Обращение.УчетнаяЗапись, Перечисления.CRM_ВидыПапокЭлектроннойПочты.Обработанные);
						Взаимодействия.УстановитьПапкуЭлектронногоПисьма(Обращение.Ссылка, Папка, Ложь);
						Результат = Новый Структура("ПапкаУстановлена", Истина);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			Если Правило.ВариантОбработки = Перечисления.CRM_ВариантыОбработкиОбращения.СоздатьИнтерес Тогда
				Если НЕ Обращение.ДополнительныеСвойства.Свойство("CRM_ТаблицаИнтересов") 
					ИЛИ Обращение.ДополнительныеСвойства.CRM_ТаблицаИнтересов.Количество() = 0 Тогда
					СоздатьИнтерес(Обращение, Правило);
				КонецЕсли;
			ИначеЕсли Правило.ВариантОбработки = Перечисления.CRM_ВариантыОбработкиОбращения.ОтклонитьОбращение Тогда
				ОтклонитьОбращение(Обращение, Правило);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьИнтерес(Обращение, Правило)
	
	Попытка
		Клиент = Неопределено;
		Контакт = Неопределено;
		ПотенциальныйКлиент = Неопределено;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Обращение, "Контакт") Тогда
			ОтправительКонтакт = Обращение.Контакт;
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Обращение, "ОтправительКонтакт") Тогда
			ОтправительКонтакт = Обращение.ОтправительКонтакт;
		Иначе
			ОтправительКонтакт = Неопределено;
		КонецЕсли;
		
		ТипКонтакта = ТипЗнч(ОтправительКонтакт);
		Если ЗначениеЗаполнено(ОтправительКонтакт) Тогда
			Если ТипКонтакта = Тип("СправочникСсылка.Партнеры") Тогда
				Клиент = ОтправительКонтакт;
				Контакт = ОтправительКонтакт.CRM_ОсновноеКонтактноеЛицо;
			ИначеЕсли ТипКонтакта = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
				Клиент = ОтправительКонтакт.Владелец;
				Контакт = ОтправительКонтакт;
			ИначеЕсли ТипКонтакта = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
				ПотенциальныйКлиент = ОтправительКонтакт;
			КонецЕсли;
		КонецЕсли;
		
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		
		НачатьТранзакцию();
		
		ОбъектИнтерес							= Документы.CRM_Интерес.СоздатьДокумент();
		ОбъектИнтерес.Дата						= ТекущаяДатаСеанса();
		ОбъектИнтерес.Автор						= ТекущийПользователь;
		
		Если ЗначениеЗаполнено(Клиент) Тогда
			ОбъектИнтерес.Партнер				= Клиент;
			ОбъектИнтерес.КонтактноеЛицо		= Контакт;
			Если ЗначениеЗаполнено(Контакт) Тогда
				СтрКонтакт = ОбъектИнтерес.Контакты.Добавить();
				СтрКонтакт.Контакт = Контакт;
				СтрКонтакт.Роль = Контакт.CRM_РольКонтактногоЛица;
			КонецЕсли;
		Иначе
			Если Не ЗначениеЗаполнено(ПотенциальныйКлиент) Тогда
				ПотенциальныйКлиент = СоздатьПотенциальныйКлиентНаСервере(Обращение.Ссылка);
			КонецЕсли;
			ОбъектИнтерес.ПотенциальныйКлиент	= ПотенциальныйКлиент;
		КонецЕсли;
		
		ПервоеСостояниеИнтереса = Справочники.CRM_СостоянияИнтересов.ПервичноеСостояниеСценария(Правило.Сценарий);
		
		ОбъектИнтерес.СостояниеИнтереса			= ПервоеСостояниеИнтереса;
		ОбъектИнтерес.ДокументОснование			= Обращение;
		ОбъектИнтерес.Описание					= Обращение.Тема;
		Если ЗначениеЗаполнено(Обращение.Ответственный) Тогда
			ОбъектИнтерес.Ответственный				= Обращение.Ответственный;
			ОбъектИнтерес.Подразделение				= CRM_ОбщегоНазначенияСервер.ПолучитьРеквизитОтветственного(ОбъектИнтерес.Ответственный, "Подразделение");
			ОбъектИнтерес.Офис						= CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ОбъектИнтерес.Подразделение, "CRM_Офис");
		Иначе
			ОбъектИнтерес.Ответственный				= Обращение.CRM_РольОтветственного;
		КонецЕсли;
		Если ЗначениеЗаполнено(Правило.ТипУслуги) Тогда
			ОбъектИнтерес.ТипУслуги				= Правило.ТипУслуги;
		Иначе
			ОбъектИнтерес.ТипУслуги				= Справочники.CRM_ТипУслуги.ПоставкаТоварыУслуги;
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Обращение, "ТекстСообщения") Тогда
			ОбъектИнтерес.Тема = Обращение.ТекстСообщения;
		Иначе 
			ОбъектИнтерес.Тема = Обращение.Тема;
		КонецЕсли;
		
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			ОбъектИнтерес.Организация				= CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ОбъектИнтерес.Ответственный, "ОсновнаяОрганизация");
			Если НЕ ЗначениеЗаполнено(ОбъектИнтерес.Организация) Тогда
				ОбъектИнтерес.Организация			= CRM_ОбщегоНазначенияСервер.ПолучитьПредопределеннуюОрганизацию();
			КонецЕсли;
		Иначе
			МодульCRM_Модуль_МетодыМодулейОбъектовДокументов = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_МетодыМодулейОбъектовДокументов");
			Если МодульCRM_Модуль_МетодыМодулейОбъектовДокументов <> Неопределено Тогда
				МодульCRM_Модуль_МетодыМодулейОбъектовДокументов.ЗаполнитьОрганизацию(ОбъектИнтерес);
			КонецЕсли;
		КонецЕсли;
		
		ЗначениеНастройки = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнойПроект");
		Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
			ОбъектИнтерес.Проект				= ЗначениеНастройки;
		КонецЕсли;
		
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			Если ТипЗнч(ОбъектИнтерес.Ответственный) = Тип("СправочникСсылка.Пользователи") Тогда
				Если ЗначениеЗаполнено(ОбъектИнтерес.Партнер) И ЗначениеЗаполнено(ОбъектИнтерес.Ответственный["CRM_УровеньДоступа"])
					И ОбъектИнтерес.Партнер["CRM_УровниДоступа"].Найти(ОбъектИнтерес.Ответственный["CRM_УровеньДоступа"],"УровеньДоступа") = Неопределено
					И ОбъектИнтерес.Партнер["CRM_УровниДоступа"].Количество() > 0 Тогда
					
					ПартнерОбъект = ОбъектИнтерес.Партнер.ПолучитьОбъект();
					НоваяСтрокаУровня = ПартнерОбъект["CRM_УровниДоступа"].Добавить();
					НоваяСтрокаУровня["УровеньДоступа"]= ОбъектИнтерес.Ответственный["CRM_УровеньДоступа"];
					ПартнерОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			Если ЗначениеЗаполнено(ОбъектИнтерес.Партнер) Тогда
				Договор = CRM_ОбщегоНазначенияСервер.ПолучитьДоговорПартнера(ОбъектИнтерес.Партнер, ОбъектИнтерес.Организация);
				Если ЗначениеЗаполнено(Договор) Тогда
					ОбъектИнтерес["Договор"] = Договор;
					ОбъектИнтерес.Валюта = Договор.ВалютаРасчетов;
					ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ОбъектИнтерес.Дата, Новый Структура("Валюта", Договор.ВалютаРасчетов));
					ОбъектИнтерес["Курс"]      = ?(ВалютаРасчетовКурсКратность.Курс = 0, 1, ВалютаРасчетовКурсКратность.Курс);
					ОбъектИнтерес["Кратность"] = ?(ВалютаРасчетовКурсКратность.Кратность = 0, 1, ВалютаРасчетовКурсКратность.Кратность);
					ОбъектИнтерес["ВидСкидкиНаценки"] = Договор.ВидСкидкиНаценки;
					ВидЦен = Договор.ВидЦен;
					ОбъектИнтерес["ВидЦен"] = ВидЦен;
					ОбъектИнтерес["ЦенаВключаетНДС"] = ВидЦен.ЦенаВключаетНДС;
				КонецЕсли;
			Иначе
				ОбъектИнтерес.Валюта = Константы.ВалютаУправленческогоУчета.Получить();
				ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ОбъектИнтерес.Дата, Новый Структура("Валюта", ОбъектИнтерес.Валюта));
				ОбъектИнтерес["Курс"]      = ?(ВалютаРасчетовКурсКратность.Курс = 0, 1, ВалютаРасчетовКурсКратность.Курс);
				ОбъектИнтерес["Кратность"] = ?(ВалютаРасчетовКурсКратность.Кратность = 0, 1, ВалютаРасчетовКурсКратность.Кратность);
				ВидЦен = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекущийПользователь, "ОсновнойВидЦенПродажи");;
				ОбъектИнтерес["ВидЦен"] = ВидЦен;
				ОбъектИнтерес["ЦенаВключаетНДС"] = ВидЦен.ЦенаВключаетНДС;
			КонецЕсли;
		Иначе
			МодульCRM_Модуль_МетодыМодулейОбъектовДокументов = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_МетодыМодулейОбъектовДокументов");
			МодульCRM_Модуль_МетодыМодулейОбъектовДокументов.ИнтересЗаполнитьРеквизитыДокумента(ОбъектИнтерес);
			Если ЗначениеЗаполнено(ОбъектИнтерес.Партнер) Тогда
				ИмяФО = "ИспользоватьСоглашенияСКлиентами";
				Если ПолучитьФункциональнуюОпцию(ИмяФО) Тогда
					// ОбъектИнтерес.Соглашение = МодульCRM_Модуль_МетодыМодулейОбъектовДокументов.ВернутьПоследнееСоглашение(Клиент); // закомментировано: не заполнять!
					ОбъектИнтерес.ЦенаВключаетНДС = ?(ОбъектИнтерес.Соглашение.Пустая(), Ложь, ОбъектИнтерес.Соглашение.ЦенаВключаетНДС);
				КонецЕсли;
			Иначе
				ОбъектИнтерес.ЦенаВключаетНДС = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ОбъектИнтерес.ТипОбращения = Правило.ТипОбращения;
		Если ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПоддержку") Тогда
			Если Правило.Сценарий.ЭтоПоддержка Тогда
				ПоляФормы = Новый Структура;
				ПоляФормы.Вставить("КонтактноеЛицо",	Контакт);
				ПоляФормы.Вставить("Организация",		ОбъектИнтерес.Организация);
				ПоляФормы.Вставить("Ответственный",		ОбъектИнтерес.Ответственный);
				ПоляФормы.Вставить("Партнер",			Клиент);
				ПоляФормы.Вставить("ТипУслуги",			ОбъектИнтерес.ТипУслуги);
				ПоляФормы.Вставить("ТипОбращения",		ОбъектИнтерес.ТипОбращения);
				ПоляФормы.Вставить("Проект",			ОбъектИнтерес.Проект);
				
				ДанныеОбращения = Справочники.CRM_УровниПоддержки.ОписаниеДанныхОбращения();
				СтрокаНабора = ДанныеОбращения.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаНабора, ПоляФормы);
				
				СтрокаНабора.Ключ			= Строка(Новый УникальныйИдентификатор);
				СтрокаНабора.Дата			= ОбъектИнтерес.Дата;
				
				ДанныеУровня = Справочники.CRM_УровниПоддержки.ДанныеУровняПоддержки(ДанныеОбращения);
				
				ОбъектИнтерес.УровеньПоддержки = ДанныеУровня.Уровень;
				СрокиПоОбращению = Справочники.CRM_УровниПоддержки.СрокиПоУровнюПоддержки(ОбъектИнтерес.Дата, ДанныеУровня.Уровень);
				ЗаполнитьЗначенияСвойств(ОбъектИнтерес, СрокиПоОбращению);
			КонецЕсли;
		КонецЕсли;
		
		ОбъектИнтерес.Записать();
		
		СозданныйИнтерес = ОбъектИнтерес.Ссылка;
		
		//Если ЗначениеЗаполнено(Канал) Тогда
		//	Менеджер = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьМенеджерЗаписи();
		//	Менеджер.Период = ОбъектИнтерес.Дата;
		//	Менеджер.Сделка = СозданныйИнтерес;
		//	Менеджер.Партнер = ?(ОбъектИнтерес.Партнер.Пустая(), ОбъектИнтерес.ПотенциальныйКлиент, ОбъектИнтерес.Партнер);
		//	Менеджер.КаналПервичногоИнтереса = Канал;
		//	Менеджер.ИсточникПервичногоИнтереса = Источник;
		//	Менеджер.Записать(Истина);
		//КонецЕсли;
		
		Если НЕ CRM_БизнесПроцессыСервер.ОбъектСвязанСБизнесПроцессом(ОбъектИнтерес.Ссылка)
			И НЕ ПервоеСостояниеИнтереса.НеСоздаватьЗадачу
			И ТипЗнч(ОбъектИнтерес.Ответственный) = Тип("СправочникСсылка.Пользователи") Тогда
			
			ДатаЗадачи = ТекущаяДатаСеанса();
			Если СозданныйИнтерес.ТипОбращения = Справочники.CRM_ТипыОбращений.Интерес Тогда
				ТекстЗадачи = НСтр("ru='Обработать новый интерес клиента';en='Process new lead'") + ?(ЗначениеЗаполнено(ОбъектИнтерес.Тема), " ("+ОбъектИнтерес.Тема+")", "");
			Иначе
				ТекстЗадачи = НСтр("ru='Обработать новое обращение: '") + НРег(СозданныйИнтерес.ТипОбращения) + ?(ЗначениеЗаполнено(ОбъектИнтерес.Тема), " ("+ОбъектИнтерес.Тема+")", "");
			КонецЕсли;	
			
			ОбъектЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
			ОбъектЗадача.Автор				= Пользователи.ТекущийПользователь();
			ОбъектЗадача.Исполнитель		= ОбъектИнтерес.Ответственный;
			ОбъектЗадача.ПринятаКИсполнению	= Истина;
			ОбъектЗадача.Наименование		= ТекстЗадачи;
			ОбъектЗадача.Дата				= ДатаЗадачи;
			ОбъектЗадача.ДатаНачала			= ДатаЗадачи;
			ОбъектЗадача.СрокИсполнения		= ДатаЗадачи;
			ОбъектЗадача.CRM_Личная			= Истина;
			ОбъектЗадача.Предмет			= СозданныйИнтерес;
			ОбъектЗадача.Описание			= ОбъектИнтерес.Описание;
			ОбъектЗадача.CRM_Партнер		= Клиент;
			ОбъектЗадача.CRM_КонтактноеЛицо	= Контакт;
			ОбъектЗадача.Записать();
	
		КонецЕсли;
		
		СвязатьОбращениеСИнтересомНаСервере(ОбъектИнтерес.Ссылка, Обращение);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстЗаписиЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'При обработке обращения %1, не удалось создать интерес.'"), Обращение);
		ЗаписьЖурналаРегистрации(ТекстЗаписиЖурнала, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтклонитьОбращение(Обращение, Правило)
	
	Если РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Обращение.Ссылка) Тогда
		РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(Обращение.Ссылка, Справочники.CRM_СостоянияЛидов.Отклонен,, Правило.ПричинаОтклонения); 
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Обращение, "CRM_СкрытьВАРМ") Тогда
		Обращение.CRM_СкрытьВАРМ = Истина;
		Обращение.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьПотенциальныйКлиентНаСервере(Обращение)
	
	ПотенциальныйКлиентОбъект = Справочники.CRM_ПотенциальныеКлиенты.СоздатьЭлемент();
	
	ТипОбращения = ТипЗнч(Обращение);
	Если ТипОбращения = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		ПотенциальныйКлиентОбъект.Наименование = Обращение.ОтправительПредставление;
		ВидКИ = Справочники.ВидыКонтактнойИнформации.CRM_EmailПотенциальногоКлиента;
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		СтруктураПолейКИ = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(ВидКИ);
		ДанныеКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураПолейКИ, Обращение.ОтправительАдрес, ВидКИ);
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ПотенциальныйКлиентОбъект, ДанныеКИ, ВидКИ, ТипКИ);
	ИначеЕсли ТипОбращения = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
		ПотенциальныйКлиентОбъект.Наименование = Обращение.КонтактПредставление;
		ВидКИ = CRM_РаботаСМессенджерамиСерверПовтИсп.ПолучитьВидКИМессенджера(Обращение.УчетнаяЗапись, Справочники.CRM_ПотенциальныеКлиенты.ПустаяСсылка());
		ТипКИ = ВидКИ.Тип;
		Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Обращение.ID_Пользователя);
			Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, "", "");
			ДанныеКИ = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Представление, ВидКИ);
		Иначе
			СтруктураПолейКИ = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(ВидКИ);
			ДанныеКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураПолейКИ, Обращение.ID_Пользователя, ВидКИ);
		КонецЕсли;
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ПотенциальныйКлиентОбъект, ДанныеКИ, ВидКИ, ТипКИ);
	ИначеЕсли ТипОбращения = Тип("ДокументСсылка.CRM_Заявка") Тогда
		ПотенциальныйКлиентОбъект.Наименование = Обращение.Наименование;
		ПотенциальныйКлиентОбъект.Организация = Обращение.Организация;
		ПотенциальныйКлиентОбъект.ОсновнойМенеджер = Обращение.Ответственный;
		
		Если ЗначениеЗаполнено(Обращение.Телефон) Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента;
			ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон;
			СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Обращение.Телефон);
			Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, "", "");
			ДанныеКИ = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Представление, ВидКИ);
			УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ПотенциальныйКлиентОбъект, ДанныеКИ, ВидКИ, ТипКИ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Обращение.ЭлектроннаяПочта) Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.CRM_EmailПотенциальногоКлиента;
			ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			СтруктураПолейКИ = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(ВидКИ);
			ДанныеКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураПолейКИ, Обращение.ЭлектроннаяПочта, ВидКИ);
			УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ПотенциальныйКлиентОбъект, ДанныеКИ, ВидКИ, ТипКИ);
		КонецЕсли;
	КонецЕсли;
	
	ПотенциальныйКлиентОбъект.Записать();
	Возврат ПотенциальныйКлиентОбъект.Ссылка;
	
КонецФункции

Процедура СвязатьОбращениеСИнтересомНаСервере(Интерес, Обращение)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	CRM_Интерес.Ссылка КАК Ссылка,
	|	CRM_Интерес.СостояниеИнтереса КАК СостояниеИнтереса,
	|	ЛОЖЬ КАК ВведенНаОсновании,
	|	ИСТИНА КАК ОсновнойИнтерес
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|ГДЕ
	|	CRM_Интерес.Ссылка = &СсылкаИнтерес
	|
	|УПОРЯДОЧИТЬ ПО
	|	CRM_Интерес.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("СсылкаИнтерес" , Интерес);
	
	ТаблицаСвязей = Запрос.Выполнить().Выгрузить();
	Если ТаблицаСвязей.Количество() > 0 Тогда
		Обращение.ДополнительныеСвойства.Вставить("CRM_ТаблицаИнтересов",ТаблицаСвязей);
	КонецЕсли;
	
	ОбращениеЯвляетсяЛидом = РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Обращение.Ссылка);
	
	Если ОбращениеЯвляетсяЛидом и ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Обращение, "CRM_СкрытьВАРМ") Тогда
		Обращение.CRM_СкрытьВАРМ = Истина;
	КонецЕсли;
	
	Обращение.Записать();
	
	Если ОбращениеЯвляетсяЛидом Тогда
		ПараметрСостояниеЛида = Справочники.CRM_СостоянияЛидов.Сконвертирован;
		РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(Обращение.Ссылка, ПараметрСостояниеЛида, Интерес);
	КонецЕсли;
	
	Если ТипЗнч(Обращение) = Тип("ДокументОбъект.ЭлектронноеПисьмоВходящее") Тогда

		// Перенос в обработанные осуществляется, если учетная запись конкретного письма разрешает данное действие,
		// а при наличии необходимости задавать вопрос о переносе - на него был дан утвердительный ответ ранее на стороне Клиента:
		Если Обращение.УчетнаяЗапись.CRM_ПереноситьВОбработанные Тогда						
			Папка = CRM_УправлениеЭлектроннойПочтой.ПолучитьПапкуЭлектронногоПисьма(Обращение.УчетнаяЗапись, Перечисления.CRM_ВидыПапокЭлектроннойПочты.Обработанные);
			Взаимодействия.УстановитьПапкуЭлектронногоПисьма(Обращение.Ссылка, Папка, Ложь);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
